In [1]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

# Решение первой задачи

In [2]:
data_1=pd.read_excel(r'Task1.xlsx')
data_2=pd.read_excel(r'Task1.xlsx','Зарплаты').iloc[:,0:3]
data_2

               Имя          Должность  Выплата за месяц (рублей)
0      Боевой конь        Программист                      50000
1  Алчный торговец  Менеджер проектов                      60000
2     Иван-царевич    Погонщик гномов                      20000

In [3]:
data=data_1[data_1.columns[6:8]]
data=data.groupby(["Исполнитель"],as_index=False). \
aggregate({"Залогированные часы":"sum"})
data

       Исполнитель  Залогированные часы
0  Алчный торговец               30.916
1      Боевой конь                6.417
2     Иван-царевич               20.333

In [4]:
df_1=data_2.merge(data, how = 'left', left_on='Имя', right_on='Исполнитель')
df_1=df_1.rename(columns={'Залогированные часы':"Часы"})
df_1['Стоимость часа']=df_1["Выплата за месяц (рублей)"] /df_1["Часы"]
df_1 = df_1.drop('Исполнитель', axis=1)
df_1

,Имя,Должность,Выплата за месяц (рублей),Часы,Стоимость часа
0,Боевой конь,Программист,50000,6.417,7791.803023
1,Алчный торговец,Менеджер проектов,60000,30.916,1940.742658
2,Иван-царевич,Погонщик гномов,20000,20.333,983.622682

In [5]:
writer = pd.ExcelWriter('Result.xlsx', engine='xlsxwriter')
df_1.to_excel(writer, sheet_name='Sheet1')

# Решение второй задачи

In [6]:
df_2=data_1.loc[:,[data_1.columns[4], data_1.columns[2],data_1.columns[7]]]
df_2=df_2.groupby(["Заказчик","Задача"],as_index=False). \
aggregate({"Залогированные часы":"sum"})
df_2.to_excel(writer, sheet_name='Sheet2')
df_2

            Заказчик                      Задача  Залогированные часы
0  Лев - царь зверей                  Тренировки                2.500
1         Серый Волк                Выковать меч               19.333
2         Серый Волк  Гномы финансируют драконов               10.000
3         Серый Волк                Купить мячик                0.500
4         Серый Волк             Найти принцессу                5.333
5         Серый Волк     Поговорить с принцессой                6.000
6         Снусмумрик         Гномы не слушаются                 8.000
7         Снусмумрик           Гномы разбегаются                6.000

In [7]:
df_2_s=df_2.loc[:,[df_2.columns[0], df_2.columns[2]]]
df_2_s=df_2_s.groupby(["Заказчик"],as_index=False). \
aggregate({"Залогированные часы":"sum"})
df_2_s.to_excel(writer, sheet_name='Sheet3')
df_2_s

            Заказчик  Залогированные часы
0  Лев - царь зверей                2.500
1         Серый Волк               41.166
2         Снусмумрик               14.000

In [8]:
writer.save()

In [9]:
sum_time=sum(df_2_s['Залогированные часы'])
print(sum_time)

57.666